; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v2 ?v5)
             (pred_3 ?v1 ?v9)
             (pred_11 ?v2 ?v9)
             (pred_5 ?v7 ?v2 )
	     (pred_8 ?v2)
             (pred_7 ?v12)
             (pred_4 ?v1)
             (pred_12 ?v9)
             (pred_1 ?v2)
             (pred_10 ?v1)
             (pred_2 ?v2)
             (pred_9 ))



(:action op_1
:parameters (?v4 ?v13 ?v11 ?v3)
:precondition (and (pred_7 ?v4) (pred_7 ?v13) (pred_4 ?v11) (pred_12 ?v3)
          (pred_6 ?v4 ?v13) (pred_3 ?v11 ?v3)
                   (pred_11 ?v13 ?v3) (pred_8 ?v4) 
                   (pred_1 ?v13) (pred_10 ?v11))
:effect (and  (pred_2 ?v13) (not (pred_1 ?v13))))


(:action op_4
:parameters (?v4 ?v8)
:precondition (and (pred_7 ?v4) (pred_7 ?v8)
               (pred_8 ?v4) (pred_6 ?v4 ?v8) (pred_2 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v4))))

(:action op_3
:parameters (?v4 ?v11)
:precondition (and (pred_7 ?v4) (pred_4 ?v11) 
                  (pred_8 ?v4) (pred_5 ?v11 ?v4) (pred_9 ))
:effect (and (pred_10 ?v11)
   (not (pred_5 ?v11 ?v4)) (not (pred_9 ))))


(:action op_2
:parameters (?v4 ?v6 ?v10)
:precondition (and (pred_7 ?v4) (pred_4 ?v6) (pred_4 ?v10)
                  (pred_8 ?v4) (pred_10 ?v10) (pred_5 ?v6 ?v4))
:effect (and (pred_10 ?v6) (pred_5 ?v10 ?v4)
        (not (pred_10 ?v10)) (not (pred_5 ?v6 ?v4))))

(:action op_5
:parameters (?v4 ?v11)
:precondition (and (pred_7 ?v4) (pred_4 ?v11) 
                  (pred_8 ?v4) (pred_10 ?v11))
:effect (and (pred_9 ) (pred_5 ?v11 ?v4) (not (pred_10 ?v11)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_02 obj_09 obj_10 obj_19 obj_04 obj_20 obj_03 obj_01 obj_15 obj_11 obj_14 obj_06 obj_21 obj_13 obj_17
    obj_22 obj_05 obj_12
    obj_08 obj_07 obj_18
    )

    (:init
       (pred_9)

       (pred_7 obj_16)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_7 obj_10)
       (pred_7 obj_19)
       (pred_7 obj_04)
       (pred_7 obj_20)
       (pred_7 obj_03)
       (pred_7 obj_01)
       (pred_7 obj_15)
       (pred_7 obj_11)
       (pred_7 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_21)
       (pred_7 obj_13)
       (pred_7 obj_17)
       (pred_12 obj_22)
       (pred_12 obj_05)
       (pred_12 obj_12)
       (pred_4 obj_08)
       (pred_4 obj_07)
       (pred_4 obj_18)

       (pred_6 obj_16 obj_19)
       (pred_6 obj_16 obj_02)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_02 obj_16)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_19 obj_04)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_04 obj_20)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_04 obj_19)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_20 obj_04)
       (pred_6 obj_03 obj_14)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_15 obj_21)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_15 obj_01)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_14)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_14 obj_03)
       (pred_6 obj_14 obj_11)
       (pred_6 obj_06 obj_21)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_21 obj_13)
       (pred_6 obj_21 obj_15)
       (pred_6 obj_21 obj_06)
       (pred_6 obj_13 obj_17)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_21)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_17 obj_13)
       (pred_1 obj_10)
       (pred_1 obj_17)
       (pred_1 obj_20)
       (pred_11  obj_10 obj_22)
       (pred_11  obj_17 obj_05)
       (pred_11  obj_20 obj_12)
       (pred_2 obj_16)
       (pred_2 obj_02)
       (pred_2 obj_09)
       (pred_2 obj_19)
       (pred_2 obj_04)
       (pred_2 obj_03)
       (pred_2 obj_01)
       (pred_2 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_21)
       (pred_2 obj_13)

       (pred_3  obj_08 obj_22)
       (pred_3  obj_07 obj_05)
       (pred_3  obj_18 obj_12)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_07 obj_11)
       (pred_5 obj_18 obj_19)
       (pred_8 obj_15)
    )

    (:goal (and
       (pred_5 obj_18 obj_02)
    ))
(:constraints
  (always (not (pred_8 obj_04)))
)
)

; plan
1. (op_4 obj_15 obj_01)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_01)
   goals met: 0 of 1
2. (op_4 obj_01 obj_19)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_19)
   goals met: 0 of 1
3. (op_3 obj_19 obj_18)
   deleted: (pred_5 obj_18 obj_19) (pred_9)
   added: (pred_10 obj_18)
   goals met: 0 of 1
4. (op_4 obj_19 obj_16)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_16)
   goals met: 0 of 1
5. (op_4 obj_16 obj_02)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_02)
   goals met: 0 of 1
6. (op_5 obj_02 obj_18)
   deleted: (pred_10 obj_18)
   added: (pred_9) (pred_5 obj_18 obj_02)
   goals met: 1 of 1
